Show / Hide Table of Contents
Class RebarBase
Represents a base class for Rebars in 3D space.
Inheritance
System.Object
OpenObject
OpenElementId
RebarBase
RebarGeneral
RebarSingle
RebarStirrups
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class RebarBase : OpenElementId
Properties
Improve this Doc   View Source
Diameter
Gets or sets the Rebar Diameter.
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GroupId
identity for group identification number
Declaration
public int GroupId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Material
Gets or sets the reference of material properties.
Declaration
public ReferenceElement Material { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
RebarAllocationElement
the element where this rebar belongs (part of that beam)
Declaration
public ReferenceElement RebarAllocationElement { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
RebarParentElement
Gets or sets the reference element of the geometry of the reference line (line along which the rebars are generated). It can be IdeaRS.OpenModel.Geometry3D.Segment3D or IdeaRS.OpenModel.Geometry3D.PolyLine3D or IdeaRS.OpenModel.Model.Member1D or IdeaRS.OpenModel.Model.Element1D
Declaration
public ReferenceElement RebarParentElement { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
RebarShape
Gets or sets the geometrical shape of the rebar. IdeaRS.OpenModel.Model.RebarShape
Declaration
public ReferenceElement RebarShape { get; set; }
Property Value
 Type |  Description
 ReferenceElement
 Improve this Doc
 View Source